//Babiienko I. K-11
#include "laba5.h"
#include <iostream>

using namespace std;

void laba5(){
cout<<"Ћабораторна номер 5 буде виконана згодом."<<endl;
}

void info5(){
cout<<"÷€ програма табулюЇ значенн€ функц≥й f(x), S(x) та S(x)-f(x) на в≥др≥зку [a; b] з кроком  h, де a0<a, b<b0.";
    cout<<endl<<"f(x)=sh(x), S(x)=sum[0; +infinity](x^(2n+1)/(2n+1)!";
    cout<<endl<<"Kористувач задаЇ:"<<endl<<"Ц значенн€ a початку в≥др≥зку, на €кому табулюЇтьс€ функц≥€;"<<endl<<"Ц значенн€ b к≥нц€ в≥др≥зку, на €кому табулюЇтьс€ функц≥€; (-0.9<=a<b<=0.9)"<<endl<<"Ц крок h з €ким виконуЇтьс€ табул€ц≥€ функц≥њ; (h>=0.1)"<<endl<<"- значенн€ e, €ке обумовлюЇ точн≥сть обчисленн€";
}
